{
  "lines": [
    {"job": "Civitas LLC", "line": "Developed a full-stack SAAS application using Rust and Dioxus for lobbyists."},
    {"job": "Civitas LLC", "line": "Led marketing campaigns targeting lobbyists via Google Ads and social media."},
    {"job": "Civitas LLC", "line": "Designed scalable systems architecture for legislative data processing."},
    {"job": "Civitas LLC", "line": "Conducted policy analysis to enhance platform functionality."},
    {"job": "Civitas LLC", "line": "Engineered responsive UI/UX components with Dioxus, improving user engagement."},
    {"job": "Civitas LLC", "line": "Managed PostgreSQL database schema and optimized queries for performance."},
    {"job": "Civitas LLC", "line": "Implemented CI/CD pipelines using GitHub Actions for automated testing and deployment."},
    {"job": "Civitas LLC", "line": "Integrated third-party APIs for enhanced data collection and service offerings."},
    {"job": "Civitas LLC", "line": "Performed regular security audits and implemented industry best practices for data protection."},
    {"job": "Civitas LLC", "line": "Collaborated with legal experts to ensure compliance with lobbying regulations."},
    {"job": "Civitas LLC", "line": "Developed data visualization dashboards for users to track legislative trends."},
    {"job": "Civitas LLC", "line": "Authored comprehensive technical documentation for the SAAS platform."},
    {"job": "Civitas LLC", "line": "Utilized asynchronous Rust programming to handle high-concurrency operations."},
    {"job": "Civitas LLC", "line": "Containerized application components using Docker for consistent environments."},
    {"job": "Civitas LLC", "line": "Monitored application health and performance using Prometheus and Grafana."},
    {"job": "Civitas LLC", "line": "Provided technical support and training to clients and internal teams."},
    {"job": "Civitas LLC", "line": "Participated in strategic planning for product roadmap and feature prioritization."},
    {"job": "Civitas LLC", "line": "Researched emerging technologies in Rust and web development for continuous improvement."},
    {"job": "Civitas LLC", "line": "Co-founded and co-own a company developing and selling public-policy software solutions for lobbyists, compliance managers, lawyers, NGOs, and policy professionals."},
    {"job": "Civitas LLC", "line": "Actively involved in developing a diverse array of competitive services and new product classes specialized for public policy operations."},
    {"job": "Civitas LLC", "line": "Applied skills in Governmental Affairs to guide product development and market strategy for public policy software."},
    {"job": "Civitas LLC", "line": "Utilized programming and software development expertise in building core product features and infrastructure."},
    {"job": "Civitas LLC", "line": "Managed projects related to software development cycles, service deployment, and feature rollouts."},
    {"job": "Civitas LLC", "line": "Contributed to sales strategies, client acquisition, and market positioning for specialized software solutions."},
    {"job": "Miller Staking", "line": "Managed administrative workflows for horse trainers and owners."},
    {"job": "Miller Staking", "line": "Implemented calendaring systems to streamline stake payments."},
    {"job": "Miller Staking", "line": "Utilized project management to ensure timely service delivery."},
    {"job": "Miller Staking", "line": "Developed and maintained client databases with accuracy and confidentiality."},
    {"job": "Miller Staking", "line": "Coordinated event logistics for race days and special client functions."},
    {"job": "Miller Staking", "line": "Handled financial administration, including invoicing and expense tracking."},
    {"job": "Miller Staking", "line": "Liaised with veterinary services and farriers for equine health management."},
    {"job": "Miller Staking", "line": "Managed communication channels, including email, phone, and newsletters."},
    {"job": "Miller Staking", "line": "Onboarded new clients and provided orientation to services and procedures."},
    {"job": "Miller Staking", "line": "Streamlined document management processes for contracts and registrations."},
    {"job": "Miller Staking", "line": "Prepared regular reports on operational activities and client accounts."},
    {"job": "Miller Staking", "line": "Ensured compliance with racing commission rules and regulations."},
    {"job": "Miller Staking", "line": "Negotiated with vendors and suppliers to optimize operational costs."},
    {"job": "Miller Staking", "line": "Provided personalized client support to enhance satisfaction and retention."},
    {"job": "Miller Staking", "line": "Assisted in the development of marketing materials and online presence."},
    {"job": "Miller Staking", "line": "Maintained inventory of supplies and equipment for daily operations."},
    {"job": "Miller Staking", "line": "Organized travel arrangements for staff and clients as needed."},
    {"job": "Miller Staking", "line": "Researched industry best practices for equine business management."},
    {"job": "Kroger Gardis and Regas LLC Marketing Manager", "line": "Crafted marketing strategies to promote legal services."},
    {"job": "Kroger Gardis and Regas LLC Marketing Manager", "line": "Managed content creation for firm’s website and campaigns."},
    {"job": "Kroger Gardis and Regas LLC Marketing Manager", "line": "Developed and executed comprehensive digital marketing plans, including SEO/SEM, email, and social media."},
    {"job": "Kroger Gardis and Regas LLC Marketing Manager", "line": "Analyzed marketing campaign performance and ROI, providing regular reports to partners."},
    {"job": "Kroger Gardis and Regas LLC Marketing Manager", "line": "Managed the firm's brand identity and ensured consistency across all marketing materials."},
    {"job": "Kroger Gardis and Regas LLC Marketing Manager", "line": "Oversaw the design and production of print collateral, including brochures and advertisements."},
    {"job": "Kroger Gardis and Regas LLC Marketing Manager", "line": "Coordinated firm participation in legal industry events, conferences, and sponsorships."},
    {"job": "Kroger Gardis and Regas LLC Marketing Manager", "line": "Conducted market research to identify target audiences and competitive landscape."},
    {"job": "Kroger Gardis and Regas LLC Marketing Manager", "line": "Managed relationships with external marketing agencies and vendors."},
    {"job": "Kroger Gardis and Regas LLC Marketing Manager", "line": "Developed and managed the marketing budget, ensuring efficient allocation of resources."},
    {"job": "Kroger Gardis and Regas LLC Marketing Manager", "line": "Implemented CRM strategies to nurture leads and manage client relationships."},
    {"job": "Kroger Gardis and Regas LLC Marketing Manager", "line": "Produced engaging blog posts, articles, and case studies to showcase firm expertise."},
    {"job": "Kroger Gardis and Regas LLC Marketing Manager", "line": "Managed website content updates and collaborated with web developers on improvements, including WordPress."},
    {"job": "Kroger Gardis and Regas LLC Marketing Manager", "line": "Directed video production for promotional and informational content."},
    {"job": "Kroger Gardis and Regas LLC Marketing Manager", "line": "Tracked and reported on key performance indicators (KPIs) for all marketing initiatives."},
    {"job": "Kroger Gardis and Regas LLC Marketing Manager", "line": "Organized internal training sessions on marketing best practices for attorneys."},
    {"job": "Kroger Gardis and Regas LLC Marketing Manager", "line": "Stayed abreast of legal marketing trends and ethical advertising guidelines, including bar rules."},
    {"job": "Kroger Gardis and Regas LLC Marketing Manager", "line": "Enhanced online presence through targeted social media engagement and advertising."},
    {"job": "Kroger Gardis and Regas LLC Marketing Manager", "line": "Oversaw media outreach efforts, encompassing online and community initiatives."},
    {"job": "Kroger Gardis and Regas LLC Marketing Manager", "line": "Authored, edited, and supervised the KGR blog and other news-related articles."},
    {"job": "Kroger Gardis and Regas LLC Marketing Manager", "line": "Collaborated closely with attorneys to identify compelling stories and newsworthy topics for media engagement."},
    {"job": "Kroger Gardis and Regas LLC Marketing Manager", "line": "Represented KGR as a spokesperson or liaison to the community and media."},
    {"job": "Kroger Gardis and Regas LLC Marketing Manager", "line": "Attended community events on behalf of KGR, overseeing community sponsorships."},
    {"job": "Kroger Gardis and Regas LLC Marketing Manager", "line": "Actively participated in tradeshows, networking events, and other legal industry-related activities."},
    {"job": "Kroger Gardis and Regas LLC Marketing Manager", "line": "Operated independently as a self-starter, bringing creative solutions to marketing challenges."},
    {"job": "Kroger Gardis and Regas LLC Marketing Manager", "line": "Utilized WordPress, PowerPoint, and Canva for content creation, presentations, and marketing materials."},
    {"job": "Kroger Gardis and Regas LLC Marketing Manager", "line": "Adhered to the highest standards of ethics and legal compliance in all marketing activities."},
    {"job": "Kroger Gardis and Regas LLC Education Team Summer Law Clerk", "line": "Conducted legal research on education policy and regulations."},
    {"job": "Kroger Gardis and Regas LLC Education Team Summer Law Clerk", "line": "Drafted legal documents supporting education team initiatives."},
    {"job": "Kroger Gardis and Regas LLC Education Team Summer Law Clerk", "line": "Analyzed statutes, case law, and administrative regulations relevant to K-12 and higher education."},
    {"job": "Kroger Gardis and Regas LLC Education Team Summer Law Clerk", "line": "Prepared legal memoranda and summaries of research findings for supervising attorneys."},
    {"job": "Kroger Gardis and Regas LLC Education Team Summer Law Clerk", "line": "Assisted in the preparation for client meetings, hearings, and depositions."},
    {"job": "Kroger Gardis and Regas LLC Education Team Summer Law Clerk", "line": "Reviewed and organized discovery documents and case files."},
    {"job": "Kroger Gardis and Regas LLC Education Team Summer Law Clerk", "line": "Attended client consultations and internal strategy sessions with the education law team."},
    {"job": "Kroger Gardis and Regas LLC Education Team Summer Law Clerk", "line": "Researched specific legal issues related to student rights, special education, and school governance."},
    {"job": "Kroger Gardis and Regas LLC Education Team Summer Law Clerk", "line": "Helped develop training materials for school districts on legal compliance matters."},
    {"job": "Kroger Gardis and Regas LLC Education Team Summer Law Clerk", "line": "Monitored legislative developments affecting educational institutions in Indiana, providing consistent updates to the team."},
    {"job": "Kroger Gardis and Regas LLC Education Team Summer Law Clerk", "line": "Shepardized cases and verified legal citations for accuracy in briefs and motions."},
    {"job": "Kroger Gardis and Regas LLC Education Team Summer Law Clerk", "line": "Observed court proceedings and administrative hearings related to education law."},
    {"job": "Kroger Gardis and Regas LLC Education Team Summer Law Clerk", "line": "Collaborated with attorneys on pro bono projects related to educational equity."},
    {"job": "Kroger Gardis and Regas LLC Education Team Summer Law Clerk", "line": "Assisted with the drafting of school board policies and administrative guidelines."},
    {"job": "Kroger Gardis and Regas LLC Education Team Summer Law Clerk", "line": "Managed and updated databases of legal precedents and research materials."},
    {"job": "Kroger Gardis and Regas LLC Education Team Summer Law Clerk", "line": "Proofread and edited legal correspondence and official documents."},
    {"job": "Kroger Gardis and Regas LLC Education Team Summer Law Clerk", "line": "Participated in team meetings to discuss case strategies and ongoing projects."},
    {"job": "Kroger Gardis and Regas LLC Education Team Summer Law Clerk", "line": "Gained practical experience in applying legal principles to real-world educational scenarios."},
    {"job": "Kroger Gardis and Regas LLC Education Team Summer Law Clerk", "line": "Assisted in addressing the comprehensive needs of the education, municipal, and public policy practice areas of the firm."},
    {"job": "Kroger Gardis and Regas LLC Education Team Summer Law Clerk", "line": "Assisted in creating, editing, and propagating policy position papers, communications, and educational content related to public policy."},
    {"job": "Kroger Gardis and Regas LLC Education Team Summer Law Clerk", "line": "Aided in scheduling meetings and communicating policy priorities with diverse stakeholders, including government officials."},
    {"job": "Kroger Gardis and Regas LLC Education Team Summer Law Clerk", "line": "Attended and networked with members of the General Assembly, policy specialists, policy analysts, and lobbyists."},
    {"job": "Kroger Gardis and Regas LLC Education Team Summer Law Clerk", "line": "Recorded and billed for policy-related projects for public and non-public school clients."},
    {"job": "Wabash College Advancement Intern", "line": "Supported fundraising campaigns through data analysis and donor research."},
    {"job": "Wabash College Advancement Intern", "line": "Coordinated alumni events to enhance engagement and foster relationships."},
    {"job": "Wabash College Advancement Intern", "line": "Provided focused support to the Advancement Special Events team, including during weekend events."},
    {"job": "Wabash College Advancement Intern", "line": "Assisted in constructing and organizing event materials and elements for alumni and fundraising events."},
    {"job": "Wabash College Advancement Intern", "line": "Managed registration check-in and attendee logistics during busy weekend events."},
    {"job": "Wabash College Advancement Intern", "line": "Supported event space set-up and tear-down."},
    {"job": "Wabash College Advancement Intern", "line": "Created and organized name badges, check-in lists, and other attendee identification materials."},
    {"job": "Wabash College Advancement Intern", "line": "Greeted and guided alumni, special guests, and other campus visitors during active event days."},
    {"job": "Wabash College Advancement Intern", "line": "Provided support to various Advancement areas, including Annual Giving, Stewardship, Gift Processing, Planned Giving, Corporate and Foundation Relations, Alumni and Parent Relations, and the Giant Steps Campaign."},
    {"job": "Wabash College Advancement Intern", "line": "Assisted with and participated in stewardship messaging to donors using ThankView video messaging platform."},
    {"job": "Wabash College Advancement Intern", "line": "Supervised Advancement Engagement Interns on projects and schedules related to alumni engagement and stewardship."},
    {"job": "Wabash College Advancement Intern", "line": "Curated a collection of photos for social media advertising and developed impact graphics for social distribution."},
    {"job": "Wabash College Advancement Intern", "line": "Identified new ways to engage alumni and others in digital and in-person spaces, creating proposals and implementation plans."},
    {"job": "Wabash College Advancement Intern", "line": "Led the digitalization and online organization of historical paper files regarding stewardship accounts and endowed funds."},
    {"job": "Wabash College Advancement Intern", "line": "Partnered with the Special Events team to develop a revised special events handbook and protocols for Campaign and Advancement events."},
    {"job": "Wabash College Advancement Intern", "line": "Assisted the Senior Administrative Assistant to the Dean for College Advancement on special projects."},
    {"job": "Various Indiana Public Schools Substitute Teacher", "line": "Taught diverse subjects to K-12 students to address teacher shortages."},
    {"job": "Various Indiana Public Schools Substitute Teacher", "line": "Adapted and implemented lesson plans to meet educational standards and ensure learning continuity."},
    {"job": "MSD of Wabash County Substitute Teacher", "line": "Taught diverse subjects across various grade levels to address teacher shortages within the district."},
    {"job": "MSD of Wabash County Substitute Teacher", "line": "Adapted and delivered existing lesson plans to ensure continuity of education and meet district standards."},
    {"job": "MSD of Wabash County Education Paraprofessional", "line": "Provided dedicated support as an Education Paraprofessional in a K-12 setting."},
    {"job": "MSD of Wabash County Education Paraprofessional", "line": "Assisted lead teachers with classroom management, instructional activities, and student supervision."},
    {"job": "MSD of Wabash County Education Paraprofessional", "line": "Worked with students individually or in small groups to reinforce learning concepts and provide academic support."},
    {"job": "Phi Delta Theta, IN Beta", "line": "Led recruitment efforts as Rush Chairmen to grow fraternity membership, introducing prospective members to the chapter."},
    {"job": "Phi Delta Theta, IN Beta", "line": "Advised executive board on strategic initiatives and long-term chapter planning as Vice President."},
    {"job": "Phi Delta Theta, IN Beta", "line": "As Vice President, worked effectively with a diverse set of internal and external stakeholders, including alumni and university officials."},
    {"job": "Phi Delta Theta, IN Beta", "line": "As Vice President, assisted in preparing finance and accounting reports to maintain program budgets and ensure financial health."},
    {"job": "Phi Delta Theta, IN Beta", "line": "As Vice President, delegated work, established clear direction, and managed workflow for chapter operations and committees."},
    {"job": "Phi Delta Theta, IN Beta", "line": "As Vice President, provided effective feedback, guidance, and coaching to develop officer skill sets and leadership capabilities."},
    {"job": "Phi Delta Theta, IN Beta", "line": "As Rush Chairmen, focused on forming close bonds with potential new members and managing the admission process for the new member class."},
    {"job": "Phi Delta Theta, IN Beta", "line": "As Risk Manager, ensured the chapter remained in compliance with risk management policies as determined by the General Headquarters (GHQ)."},
    {"job": "Phi Delta Theta, IN Beta", "line": "As Risk Manager, developed and implemented strategies to mitigate risks associated with chapter events and activities."},
    {"job": "Phi Delta Theta, IN Beta", "line": "As Risk Manager, educated chapter members on risk management protocols and safety procedures."},
    {"job": "Phi Delta Theta, IN Beta", "line": "As Risk Manager, maintained technical documentation related to risk management policies and incident reports."},
    {"job": "Miami County Agricultural Association Webmaster", "line": "Maintained and updated association website using HTML and CSS."},
    {"job": "Miami County Agricultural Association Webmaster", "line": "Optimized website for user engagement and accessibility."},
    {"job": "TEDxWabashCollege Curation Team Member", "line": "Engaged with team members and speakers to coach them in developing speeches to the 'TED' standard of excellence."},
    {"job": "TEDxWabashCollege Curation Team Member", "line": "Assisted assigned speakers in creating, structuring, and organizing their speeches to convey clear and impactful messages."},
    {"job": "TEDxWabashCollege Curation Team Member", "line": "Utilized editing skills to refine speech content, improve clarity, and enhance delivery for TEDx talks."},
    {"job": "Lowe's Companies, Inc. Seasonal Sales Associate", "line": "Trained and executed best-in-class customer service at all levels of customer interaction in a retail environment."},
    {"job": "Lowe's Companies, Inc. Seasonal Sales Associate", "line": "Managed order preparation and proactively renegotiated contract terms to enhance customer satisfaction and drive revenue."},
    {"job": "Lowe's Companies, Inc. Seasonal Sales Associate", "line": "Delivered S.M.A.R.T. customer service consistently to meet and exceed customer expectations."},
    {"job": "Lowe's Companies, Inc. Seasonal Sales Associate", "line": "Conducted phone sales and negotiated sales and installation contracts, specializing in flooring products."},
    {"job": "Lowe's Companies, Inc. Seasonal Sales Associate", "line": "Operated counterbalance lift-truck safely and efficiently for inventory management and order fulfillment."},
    {"job": "Lowe's Companies, Inc. Seasonal Sales Associate", "line": "Ensured high levels of customer satisfaction through proactive service, problem-solving, and issue resolution."},
    {"job": "Lowe's Companies, Inc. Seasonal Sales Associate", "line": "Managed pending orders and customer information utilizing proprietary database management software."},
    {"job": "Lowe's Companies, Inc. Seasonal Sales Associate", "line": "Achieved average sales of nearly $12,000 in flooring and installation contracts monthly as a seasonal associate."},
    {"job": "Lowe's Companies, Inc. Seasonal Sales Associate", "line": "Enhanced personability and interpersonal skills to interact with a diverse customer base effectively and provide superior service."},
    {"job": "Cambell Cruize Inc Summer Associate", "line": "Assumed responsibilities and workload comparable to a general contractor in a construction environment."},
    {"job": "Cambell Cruize Inc Summer Associate", "line": "Consistently earned a high degree of satisfaction from the employer and customers through diligent work and quality outcomes."},
    {"job": "Cambell Cruize Inc Summer Associate", "line": "Managed time effectively to meet project deadlines and deliverables in a fast-paced contracting setting."},
    {"job": "Cambell Cruize Inc Summer Associate", "line": "Maintained clear communication with team members and clients, and prepared technical documentation as needed for projects."},
    {"job": "Douglas D Martz Law Offices Intern", "line": "Observed the day-to-day operations and professional life of a lawyer in a private practice setting."},
    {"job": "Douglas D Martz Law Offices Intern", "line": "Performed general office management tasks, including cleaning, digitizing files, managing contacts, screening calls, and organizing case files."},
    {"job": "Douglas D Martz Law Offices Intern", "line": "Transcribed interrogations and proofread legal briefs and documents for accuracy and completeness."},
    {"job": "Douglas D Martz Law Offices Intern", "line": "Communicated with local government bodies and court personnel on behalf of the law office."},
    {"job": "Douglas D Martz Law Offices Intern", "line": "Conducted legal research using myCase and other legal resources to support case preparation."},
    {"job": "Douglas D Martz Law Offices Intern", "line": "Assisted with various tasks focused on legal matters, contributing to the overall efficiency of the firm."}
  ],
  "skills": ["Business Management", "Project Management", "Linux Administration", "Nix", "Systems Architecture", "Lobbying", "Policy Analysis", "Legislative Monitoring", "Legal Reasoning"]
}